import React from "react";
import SurveyForm from "@/components/Form/SurveyForm/SurveyForm";
import { GetQuestion } from "./action/Question";

export default async function page() {
  // const Question = await GetQuestion();

  const Question = {
    data: [
      {
        _id: "67064e0d6c787c317758e927",
        categories: [
          {
            id: 1,
            name: "การสร้างแรงจูงใจให้กับพนักงาน (Motivating people as they work)",
            questions: [
              {
                id: 1,
                text: "ท่านรับรู้และเข้าใจถึงจุดมุ่งหมายในการทำงานของพนักงานของท่านทุกคน",
              },
              {
                id: 2,
                text: "ท่านสามารถบริหารงานในความรับผิดชอบให้ตอบสนองทั้งเป้าหมายองค์กรและจุดมุ่งหมายในการทำงานของพนักงานของท่าน",
              },
              {
                id: 3,
                text: "ท่านสื่อสารและเน้นย้ำให้พนักงานของท่านทุกคนตระหนักถึงความสำคัญของงานที่ตนเองรับผิดชอบ ที่มีต่อเพื่อนร่วมงานและองค์กร",
              },
              {
                id: 4,
                text: "ท่านกระตุ้นและอธิบายให้พนักงานของท่านเห็นโอกาส ความท้าทายในการทำงานอย่างสม่ำเสมอ",
              },
              {
                id: 5,
                text: "ท่านสนับสนุนให้พนักงานของท่านได้นำเสนอความคิดเห็น หรือไอเดียใหม่ๆ อย่างสม่ำเสมอ",
              },
              {
                id: 6,
                text: "ท่านเปิดโอกาสให้พนักงานของท่านได้บอกเล่าประสบการณ์ทำงานที่ดีกับเพื่อนร่วมงานเป็นประจำ",
              },
              {
                id: 7,
                text: "ท่านชมเชยและให้กำลังใจพนักงานของท่านทุกคนโดยปราศจากอคติ เมื่อเขาเหล่านั้นได้สร้างผลงานที่ดี",
              },
            ],
          },
          {
            id: 2,
            name: "การพัฒนาพนักงานให้มีความสามารถมากขึ้น (Developing people as they work)",
            questions: [
              {
                id: 1,
                text: "ท่านทราบจุดอ่อนและจุดแข็งของพนักงานของท่านทุกคน",
              },
              {
                id: 2,
                text: "ท่านมีวิธีการและแนวทางการพัฒนาพนักงานของท่านอย่างเหมาะสมกับพนักงานแต่ละคน",
              },
              {
                id: 3,
                text: "ท่านมีการวางแผนการพัฒนาทักษะของพนักงานของท่านอย่างเป็นระบบ เพื่อให้สอดรับกับทิศทางขององค์กร",
              },
              {
                id: 4,
                text: "ท่านให้คำปรึกษา แลกเปลี่ยนประสบการณ์การทำงานกับพนักงานของท่านเป็นประจำ",
              },
              {
                id: 5,
                text: "ท่านแนะนำเทคนิควิธีการ เคล็ดลับในการทำงานให้กับพนักงานของท่านอยู่เสมอ",
              },
              {
                id: 6,
                text: "ท่านสร้างบรรยากาศและวิธีการเรียนรู้ที่หลากหลายเพื่อกระตุ้นให้พนักงานของท่านทุกคนเกิดการเรียนรู้อยู่ตลอดเวลา",
              },
              {
                id: 7,
                text: "ท่านมีการวางแผนพัฒนาพนักงานอย่างเป็นระบบ เพื่อรับผิดชอบงานตำแหน่งสำคัญขององค์กรในอนาคต",
              },
              {
                id: 8,
                text: "ท่านถ่ายทอดและแนะนำพนักงานของท่านอย่างต่อเนื่อง เพื่อให้มีศักยภาพเพียงพอกับการก้าวขึ้นมารับผิดชอบงานในระดับที่สูงขึ้น",
              },
            ],
          },
          {
            id: 3,
            name: "การกำกับ ควบคุม ดูแลพนักงานให้สามารถทำงานได้ตามเป้าหมาย (Directing people as they work)",
            questions: [
              {
                id: 1,
                text: "ท่านกำกับดูแลและติดตามการปฏิบัติงานของพนักงานของท่านอย่างใกล้ชิดและสม่ำเสมอ",
              },
              {
                id: 2,
                text: "ท่านสื่อสารและถ่ายทอดแนวคิดการทำงานให้กับพนักงานของท่านทุกคนเกิดความเข้าใจได้อย่างชัดเจน",
              },
              {
                id: 3,
                text: "ท่านให้ข้อเสนอแนะในการปรับปรุงงานกับพนักงานอย่างสม่ำเสมอ",
              },
              {
                id: 4,
                text: "ท่านสามารถบริหารจัดการพนักงานให้ทำงานเป็นทีมได้อย่างมีประสิทธิภาพ",
              },
              {
                id: 5,
                text: "ท่านสามารถจัดการกับความขัดแย้งระหว่างพนักงานได้ทุกครั้ง",
              },
              {
                id: 6,
                text: "ท่านปฏิบัติต่อพนักงานทุกคนอย่างเท่าเทียมและเป็นธรรมในทุกๆ ด้าน",
              },
            ],
          },
          {
            id: 4,
            name: "การคัดเลือกและจัดคนให้หมาะกับงาน (Identifying the best people for the job)",
            questions: [
              {
                id: 1,
                text: "ท่านรู้ถึงระดับความสามารถของพนักงานของท่านทุกคน",
              },
              {
                id: 2,
                text: "ท่านสามารถจัดสรรพนักงานที่มีระดับทักษะที่แตกต่างกันให้ทำงานร่วมกันได้อย่างลงตัว",
              },
              {
                id: 3,
                text: "ท่านทราบถึงทัศนคติและอุปนิสัยของพนักงานของท่านทุกคน",
              },
              {
                id: 4,
                text: "ท่านมีกระบวนการที่เป็นระบบในการเลือกพนักงานที่ควรจะเป็นคนเก่งขององค์กร (Talent) ขององค์กร",
              },
              {
                id: 5,
                text: "ท่านสนับสนุนและส่งเสริมพนักงานที่ควรจะเป็นคนเก่งขององค์กร (Talent) ให้ได้รับการพัฒนาที่เหมาะสม",
              },
              {
                id: 6,
                text: "ท่านทราบถึงแนวโน้มการเปลี่ยนแปลงในอนาคตของงานทุกงานภายใต้การบริหารของท่าน",
              },
              {
                id: 7,
                text: "ท่านมีแนวทางในการเตรียมคนอย่างเป็นระบบ เพื่อให้มีความรู้และทักษะเหมาะสมกับงานที่มีแนวโน้มเปลี่ยนแปลงในอนาคต",
              },
            ],
          },
        ],
        scores: [
          {
            text: "เห็นด้วยอย่างยิ่ง",
            score: 5,
          },
          {
            text: "ค่อนข้างเห็นด้วย",
            score: 4,
          },
          {
            text: "เฉยๆ",
            score: 3,
          },
          {
            text: "ไม่ค่อยเห็นด้วย",
            score: 2,
          },
          {
            text: "ไม่เห็นด้วยอย่างยิ่ง",
            score: 1,
          },
        ],
      },
    ],
  };

  return (
    <div>
      <SurveyForm QuestionData={Question.data[0]} />
    </div>
  );
}
